import { formatTitle, MetadataTemplate, parseLocale } from '@/lib/utilities'

function DataPointLogo() {
  return (
    <svg
      className="DPLogo"
      id="outputsvg"
      width="430"
      height="120"
      viewBox="0 0 14933.627 2757.4036"
      version="1.1"
      xmlns="http://www.w3.org/2000/svg"
    >
      <defs id="defs71" />
      <g
        id="l6ayamJ1YpX36Lw18PkitaW"
        className="fill-orange-500"
        transform="translate(-617.37305,-1011.303)"
      >
        <g id="g54">
          <path
            id="pOBwScBp9"
            d="m 7259,3753 c -2,-11 -14,34 188,-718 101,-379 200,-748 219,-820 19,-71 48,-179 64,-240 17,-60 43,-159 59,-220 16,-60 63,-238 105,-395 42,-157 80,-298 84,-315 l 8,-30 182,-3 c 144,-2 182,0 182,10 0,8 -24,103 -54,213 -89,333 -184,687 -251,935 -35,129 -73,269 -84,310 -37,142 -270,1005 -307,1143 l -38,137 h -178 c -98,0 -179,-3 -179,-7 z"
          />
          <path
            id="p4FhCdIuL"
            d="m 618,2745 c -3,-4 5,-47 19,-98 13,-51 37,-139 53,-197 48,-181 270,-1009 306,-1143 19,-71 34,-130 34,-133 0,-2 47,-4 105,-4 58,0 105,3 105,8 0,4 -13,54 -29,112 -16,58 -48,177 -71,265 -68,257 -227,849 -264,985 -19,69 -40,144 -46,168 l -11,42 h -98 c -54,0 -100,-2 -103,-5 z"
          />
          <path
            id="p19LRV1apx"
            d="m 960,2718 c 5,-18 63,-235 129,-483 66,-247 156,-586 200,-751 45,-166 81,-305 81,-308 0,-3 162,-6 360,-6 h 361 l 47,24 c 152,78 292,251 357,441 23,67 32,280 15,383 -14,91 -67,257 -106,333 -72,143 -206,292 -325,362 l -64,37 H 1484 952 Z m 1069,-249 c 129,-86 227,-232 272,-404 28,-106 29,-255 4,-344 -25,-87 -100,-199 -172,-255 -98,-77 -91,-76 -366,-76 -135,0 -248,4 -251,8 -4,7 -39,137 -114,422 -11,41 -45,167 -75,280 -82,303 -107,397 -107,404 0,3 168,6 374,6 h 374 z"
          />
          <path
            id="p17h6mpNDo"
            d="m 2490,2745 c 0,-4 24,-49 123,-225 20,-37 128,-232 317,-575 15,-27 74,-133 130,-235 56,-102 116,-210 133,-240 44,-81 116,-209 144,-259 l 25,-43 52,93 c 29,52 94,173 146,269 51,96 103,193 116,215 12,22 56,105 99,185 43,80 119,222 170,315 160,296 265,492 265,499 0,3 -49,6 -109,6 h -109 l -192,-357 c -106,-197 -242,-450 -303,-563 -60,-113 -116,-216 -124,-229 -17,-27 -6,-45 -303,494 -78,143 -178,323 -221,400 -42,77 -91,165 -107,195 l -31,55 -110,3 c -61,1 -111,0 -111,-3 z"
          />
          <path
            id="p1HeTcRxeJ"
            d="m 2810,2746 c 0,-3 37,-72 115,-212 73,-130 241,-435 260,-469 105,-192 170,-305 176,-305 4,0 44,69 88,153 83,156 137,258 208,388 41,74 74,137 153,284 24,44 54,99 67,123 l 24,42 h -73 -73 l -75,-143 c -215,-405 -316,-587 -327,-587 -7,0 -13,4 -13,10 0,5 -88,169 -196,365 l -197,355 h -68 c -38,0 -69,-2 -69,-4 z"
          />
          <path
            id="pGTEcavbt"
            d="m 4770,2130 v -620 h 125 125 v 620 620 h -125 -124 z"
          />
          <path
            id="pGbRpdqzJ"
            d="m 5535,2733 c 3,-10 43,-83 87,-163 45,-80 117,-210 161,-290 43,-80 93,-170 110,-200 17,-30 85,-154 152,-275 67,-121 173,-313 236,-427 63,-114 117,-204 121,-200 4,4 32,52 61,107 30,55 115,213 189,350 74,138 168,311 208,385 40,74 87,162 105,195 18,33 85,159 150,280 65,121 121,224 126,230 20,21 4,25 -100,25 -75,0 -112,-4 -118,-12 -6,-7 -34,-58 -63,-113 -59,-112 -127,-238 -320,-595 -73,-135 -157,-291 -188,-348 -30,-57 -58,-100 -62,-95 -4,4 -83,145 -175,313 -93,168 -212,384 -265,480 -54,96 -112,202 -130,235 -18,33 -42,77 -53,98 l -21,37 h -109 c -100,0 -109,-1 -102,-17 z"
          />
          <path
            id="p1FpdthEWH"
            d="m 4200,1285 v -125 h 675 675 v 125 125 h -675 -675 z"
          />
        </g>
      </g>
      <g
        id="l78hKon6GbhSABuy3bDJp2S"
        className="fill-gray-300"
        transform="translate(-617.37305,-1011.303)"
      >
        <g id="g65">
          <path
            id="pLn0RTZsg"
            d="m 10500,3758 c -85,-12 -216,-57 -286,-99 -102,-61 -206,-176 -265,-291 -43,-85 -75,-214 -81,-332 l -3,-59 165,-1 165,-1 8,50 c 46,276 168,422 384,455 224,35 421,-93 489,-319 54,-181 35,-447 -44,-589 -55,-98 -146,-168 -255,-196 l -52,-13 -3,-143 -3,-142 58,6 c 92,11 171,35 263,79 112,54 247,185 303,294 140,270 142,661 4,928 -48,93 -176,229 -268,283 -147,86 -367,120 -579,90 z"
          />
          <path
            id="pCysN5kHD"
            d="m 8535,3748 c -3,-7 -4,-391 -3,-853 l 3,-840 h 125 125 v 850 850 l -123,3 c -92,2 -124,-1 -127,-10 z"
          />
          <path
            id="p1DbXfG6f8"
            d="m 11830,2911 v -850 l 121,-3 c 66,-2 123,-1 125,1 2,2 4,386 4,853 v 848 h -125 -125 z"
          />
          <path
            id="pdI1fSfiz"
            d="m 12750,2905 v -855 h 120 120 v 855 855 h -120 -120 z"
          />
          <path
            id="pHVXYuuYZ"
            d="m 13517,3493 c -69,-148 -187,-395 -262,-551 l -135,-283 2,-302 3,-302 69,140 c 37,77 78,163 91,190 12,28 84,181 160,340 76,160 155,327 176,373 38,82 50,98 47,65 -1,-10 0,-263 0,-563 l 2,-545 h 120 120 v 853 852 h -133 -133 z"
          />
          <path
            id="pp6PJTw8F"
            d="m 14776,3751 c -4,-5 -5,-317 -4,-693 l 3,-683 h 125 125 v 690 690 l -122,3 c -69,1 -124,-1 -127,-7 z"
          />
          <path
            id="p1BA6bZJ3I"
            d="m 8890,3046 v -96 h 143 c 241,0 371,-33 453,-115 77,-76 98,-129 98,-245 1,-86 -2,-101 -29,-155 -35,-69 -86,-113 -170,-144 -80,-30 -168,-41 -343,-41 h -153 l 3,-97 3,-98 120,-3 c 135,-4 318,11 415,34 206,47 361,189 400,365 20,88 8,249 -23,326 -50,124 -143,223 -271,288 -112,57 -164,66 -418,72 l -228,6 z"
          />
          <path
            id="p1EmodKXXe"
            d="m 14207,2303 c -4,-3 -7,-60 -7,-125 v -118 h 675 676 l -3,123 -3,122 -666,3 c -366,1 -669,-1 -672,-5 z"
          />
        </g>
      </g>
    </svg>
  )
}

export function generateStaticParams() {
  return [{ lang: 'en' }, { lang: 'ru' }]
}

export function generateMetadata({ params }) {
  const localeInfo = parseLocale(params['lang'])
  return MetadataTemplate(localeInfo.isRussian ? 'Data Point — мультимедийный проект-вселенная, используемый PythSource для создания различного контента.' : 'Data Point is a multimedia project-universe used by PythSource to develop various content.', formatTitle('Data Point'), localeInfo.isRussian)
}

export default function Main({ params }) {
  const localeInfo = parseLocale(params['lang'])

  return (
    <>
      <div className='w-full h-full'>
        <div className='flex flex-col items-center slide-top gap-2'>
          {DataPointLogo()}
          <div className='flex flex-col md:flex-row w-full justify-between items-center'>
            <div className='p-5 w-full border-b md:border-b-0 md:border-r border-color-default'>
              <article>
                {localeInfo.isRussian ? <p><b>Проект Data Point</b> — большой мультимедийный проект, в настоящее время разрабатываемый PythSource. Создан в 2022 году, после упразднения вселенной World Factions. Основной целью проекта является создание основы для всех будущих интерактивных проектов PythSource.</p> : <p>The <b>Data Point Project</b> is a large multimedia project, currently being developed by PythSource. It
                was created in 2022, after the dissolution of the World Factions universe. The main goal of the project
                  is to create a foundation for all future PythSource interactive projects.</p>}
              </article>
            </div>
            <div className='p-5 w-full'>
              <article>
                {localeInfo.isRussian ? <p>Основное действие проекта происходит на вымышленной планете Элотерра. Проект является косвенным продолжением истории World Factions.</p> : <p>Set on a fictional planet of Welloterra, it depicts an indirect continuation of the World Factions story.</p>}
              </article>
            </div>
          </div>
        </div>
      </div>
    </>
  )
}